'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
'''

import math

a=0
b=10

a=math.factorial(b)

print(a)